app/controllers/members_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show_member_posts
    member = Member.find(params[:id])

INSERT INTO "members" ("first_name", "last_name", "email", "created_at", "updated_at", "avatar_id") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "alfredo"], ["last_name", "binachi"], ["email", "abinachi@gmail.com"], ["created_at", "2018-03-26 07:12:54.745181"], ["updated_at", "2018-03-26 07:12:54.745181"], ["avatar_id", nil]]
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save

UPDATE "members" SET "mobile_phone" = ?, "username" = ?, "avatar_id" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["mobile_phone", "04064928334"], ["username", "stevie1965"], ["avatar_id", "5cb415c80e97ca49d38a2ce4988e2294bc57f5112a7f5c0191bec1fcfc6b"], ["updated_at", "2018-03-27 02:26:30.140481"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @member.update(member_params)