app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at") VALUES (?, ?, ?)  [["caption", "steve's first post"], ["created_at", "2018-03-21 03:48:56.702765"], ["updated_at", "2018-03-21 03:48:56.702765"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "profile_image_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["profile_image_id", "348e8035470552629eec319c3822ec5491b2b21833ddd5101adf12f8523e"], ["updated_at", "2018-03-27 03:41:50.592037"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)