app/views/members/show_member_posts.html.erb


      <p> Posted by <%= post.member.first_name %> </p>
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]